# Reading and Writing Data
- this chapter focuses on I/O API functions that pandas provides to read and write data as df objects.
 - We will learn how to interact with SQL and NoSQL, including examples that show how to store data in a df
 - Also, learn how to read data contained in a database and retrieve them as a df
## I/O API Tools
 - Pandas is specialized for data analysis, so you expect that it is mainly focused on calculation and data processing
 - the processes of writing and reading data from/to external files can be considered part of data processing
 - Can perform some operations in order to prepare the incoming data manipulation
     - a set of functions called I/O API --> These functions are divided into readers and writers
     - __Readers__: *read_csv,read_excel,read_hdf,read_sql,read_html,read_json, read_stata, read_clipboard, read_pickle*
     - __Writers__: *to_csv, to_excel, to_hdf,to_sql, to_json, to_html, to_stata, to_clipboard, to_pickle*
## CSV and Textual Files
 - read_csv
 - read_table
 - to_csv

## Reading Data in CSV or Text Files

In [1]:
import numpy as np
import pandas as pd

csvframe = pd.read_csv('ch05_01.csv')
csvframe

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

- As you can see, reading the data is rather trivial, CSV files are tabulated data in which the values on the same col are separated by commas, can also use _read_table()_ function, but specify the delimiter

In [2]:
pd.read_table('ch05_01.csv',sep=',')

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [3]:
pd.read_csv('ch05_02.csv')

   1  5  2  3    cat
0  2  7  8  5    dog
1  3  3  6  7  horse
2  2  2  8  3   duck
3  4  4  2  1  mouse

In [4]:
pd.read_csv('ch05_02.csv',header=None)

   0  1  2  3      4
0  1  5  2  3    cat
1  2  7  8  5    dog
2  3  3  6  7  horse
3  2  2  8  3   duck
4  4  4  2  1  mouse

In [5]:
pd.read_csv('ch05_02.csv',names=['white','red','blue','green','animal',])

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [6]:
pd.read_csv('ch05_03.csv',index_col=['color','status'])

              item1  item2  item3
color status
black up          3      4      6
      down        2      6      7
white up          5      5      5
      down        3      3      2
      left        1      2      1
red   up          2      2      2
      down        1      1      4

## Using RegExp to Parse TXT Files
- if your txt file is separated by spaces or tabs in an unpredictable order then you can use the wildcard /__s*__. The /s stands for space, /t for tab, asterisk indicated that there may be multiple characters
    - .: single character, except newline
    - \d: digit
    - \D: non-digit
    - \s: whitespace character
    - \S: Non-whitespace character
    - \n: New line character
    - \t: tab character
    - \uxxxx: unicode character specified by the hexadecimal number xxxx

In [7]:
pd.read_table('ch05_04.txt',sep='\s+',engine='python')
#result is a perfect df in wihch values are perfectly ordered

   white  red  blue  green
0      1    5     2      3
1      2    7     8      5
2      3    3     6      7

In [8]:
#our text file is jumpled with both letters and numbers, and we nee to extract the numbers
#so we separate by the non-digit characters to get the result
pd.read_table('ch05_05.txt',sep='\D+', header=None,engine='python')

   0    1    2
0  0  123  122
1  1  124  321
2  2  125  333

In [9]:
#we can skip rows with skiprows option, but please PAY ATTENTION WHEN USING THIS OPTION!!!
#if for ex: you want to skip 5 rows, skiprows=5, if you want to exclude the 5th row use
#skiprows =[5]

In [10]:
pd.read_table('ch05_06.txt',sep=',',skiprows=[0,1,3,6])

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

## Reading TXT files Into Parts
- when large files need to be processed usually you want to separate the data into parts (chunks), this is t both apply any iterations and becuase we are not interested in parsing the entire file.
- if for examples, you wanted to read only a portion of the file, you can explicitly specify the number of lines on which to parse. Thanks to the nrows and skiprows options you can select the staring line n(n=skiprows) and the lines to be read after it (nrows=i)

In [11]:
pd.read_csv('ch05_02.csv',skiprows=[2],nrows=3,header=None)

   0  1  2  3     4
0  1  5  2  3   cat
1  2  7  8  5   dog
2  2  2  8  3  duck

- we can also split into portions that part of the text on which you want to parse
    - ex: we may want to add the values in a col every 3 rows and then insert these sums in a series...

In [12]:
out = pd.Series()
i = 0
pieces= pd.read_csv('ch05_01.csv',chunksize=3)
for piece in pieces:
    out.set_value(i,piece['white'].sum())
    i = i+1

/Users/macbookproi7/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:5: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """

In [13]:
out

0    6
1    6
dtype: int64

## Writing Data into a CSV

In [14]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index = ['red','blue','yellow','white'],
                    columns = ['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [15]:
frame.to_csv('ch05_07.csv', index=False,header=False) #turns off index labeling and heading

In [16]:
#remember when writing files is tha NaN values present in a data structure are shown
#as empty fields in the file
frame3 = pd.DataFrame([[6,np.nan,np.nan,6,np.nan],[np.nan,np.nan,np.nan,np.nan,np.nan],\
                      [np.nan,np.nan,np.nan,np.nan,np.nan],\
                      [20,np.nan,np.nan,20.0,np.nan],\
                      [19,np.nan,np.nan,19.0,np.nan]],
                     index = ['blue','green','red','white','yellow'],
                     columns = ['ball','mug','paper','pen','pencil'])
frame3

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [17]:
frame3.to_csv('ch05_08.csv')

In [18]:
#can replace this empty field with a value to your liking using the na_rep option
frame3.to_csv('ch05_09.csv',na_rep='NaN')

In [19]:
#all these functions also work with Series

## Reading and Writing HTML Files
- read_html() and to_html()
- this is called web scraping--> integrated in data mning and data prep

## Writing Data in HTML
- the internal structure of the df is automatically converted into nested tags i.e. < TH >,< TR >,< TD > retaining any internal heirarchies -->doesnt require knowledge of html to use the functions

In [20]:
frame = pd.DataFrame(np.arange(4).reshape(2,2))

In [21]:
#since the I/O API functions are defined in the pandas structures you can call to_html()
#directly on the instance of the df
print(frame.to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>3</td>
    </tr>
  </tbody>
</table>

In [22]:
#WOW! PRETTY COOL! Gives it in correct HTML format
#now lets make it a bit more interesting...
frame = pd.DataFrame(np.random.random((4,4)),
                    index = ['white','black','red','blue'],
                    columns = ['up','down','right','left'])
frame

             up      down     right      left
white  0.571860  0.559037  0.691235  0.908581
black  0.954253  0.480606  0.204922  0.877391
red    0.081521  0.998695  0.394562  0.907629
blue   0.562730  0.445793  0.958346  0.717004

In [23]:
#now we focus on writing an html page through the generation of a string. This is 
#simple and trivial example but it is very useful to understand and test the functionality
#of pandas directly on the web browser
s = ['HTML']
s.append('<HEAD><TITLE>My DataFrame</TITLE></HEAD>')
s.append('<BODY>')
s.append(frame.to_html())
s.append('</BODY></HTML>')

In [24]:
html = "".join(s)

In [25]:
html_file = open('myFrame.html','w')
html_file.write(html)
html_file.close()

## Reading Data from an HTML File
- read_html() will perform a parsin an HTML page looking for an HTML table, if found it will convert it into an object df ready to be used in our data analysis
    - more precisely, it returns a list of df's even if there is only 1 table

In [26]:
web_frames = pd.read_html('myFrame.html')
web_frames[0]

  Unnamed: 0        up      down     right      left
0      white  0.571860  0.559037  0.691235  0.908581
1      black  0.954253  0.480606  0.204922  0.877391
2        red  0.081521  0.998695  0.394562  0.907629
3       blue  0.562730  0.445793  0.958346  0.717004

In [27]:
# we can select the item from the list in a classic way, in the above ex
# the item was unique so the index was 0

In [28]:
#most common is using read_html() directly on a URL
ranking = pd.read_html('https://www.meccanismocomplesso.org/en/meccanismo-complesso-sito-2/classifica-punteggio/')
ranking[0]

       #                        Nome    Exp  Livelli
0      1                 Fabio Nelli  17622      NaN
1      2                       admin   9029      NaN
2      3                 BrunoOrsini   2128      NaN
3      4                   Berserker    700      NaN
4      5                    Dnocioni    543      NaN
5      6             albertosallusti    409      NaN
6      7                         Jon    237      NaN
7      8                        Mr.Y    180      NaN
8      9             michele sisinni    157      NaN
9     10                      Selina    136      NaN
10    11             Beniamino Feula    130      NaN
11    12                     Massimo    128      NaN
12    13              stefano gustin    121      NaN
13    14           Maurizio Andreoli    111      NaN
14    15              Leonardo Zampi    109      NaN
15    16                Pietro Baima    108      NaN
16    17  Cecilia Lalatta Costerbosa    108      NaN
17    18               Davide Aloisi    107      NaN
18    19               gildalombardi    105      NaN
19    20               Telerobotlabs    105      NaN
20    21            Marco Contigiani    101      NaN
21    22                    berillio     58      NaN
22    23                         ron     55      NaN
23    24                  Titanic4wd     43      NaN
24    25                         deg     40      NaN
25    26                        al45     40      NaN
26    27                      il_mix     38      NaN
27    28                     AndreaC     35      NaN
28    29                  Sergio fly     32      NaN
29    30                     bigazzi     32      NaN
..   ...                         ...    ...      ...
220  221                   giospin06      4      NaN
221  222                    fdaniele      4      NaN
222  223                squarewheel7      4      NaN
223  224                    sbindo74      4      NaN
224  225                    Cocowest      4      NaN
225  226                        Gigi      4      NaN
226  227                Franzthepanz      4      NaN
227  228                     Dimitri      4      NaN
228  229                  lauralisa1      4      NaN
229  230                      giulio      4      NaN
230  231      mario.testini@alice.it      4      NaN
231  232                      Armote      4      NaN
232  233                       Fabri      4      NaN
233  234                     pierr86      4      NaN
234  235                    Ziomulti      3      NaN
235  236                     MICHELE      3      NaN
236  237                     frgallo      3      NaN
237  238                       Wlady      3      NaN
238  239                        Sinh      3      NaN
239  240                    ezmcvngj      3      NaN
240  241                    JamesNok      3      NaN
241  242                alancarter10      3      NaN
242  243                     cirot93      3      NaN
243  244                       Gigio      3      NaN
244  245                      Clivem      3      NaN
245  246                   Eugenepox      3      NaN
246  247                      andrea      3      NaN
247  248                        pozi      3      NaN
248  249                      mattia      3      NaN
249  250             mauro.menegazzi      3      NaN

[250 rows x 4 columns]

## Reading Data from XML
- in the list of I/O API functions there is no tool regarding XML (Extensible Markup Language) format, but luckily python has other librariessss
- please visit http://lxml.de/index.html

In [29]:
from lxml import objectify

In [30]:
xml = objectify.parse('books.xml')
xml

In [31]:
#We have an object tree with an internal data structure of xml, to navigate we must
#define a root, once that is defined we can access attributes via tags
root = xml.getroot()
root

In [32]:
root.getchildren() #this allows for access to multiple ones at the same time, you'll get
                    #all the child nodes of the reference element

[<Element book at 0x11578bec8>,
 <Element book at 0x117fd7048>,
 <Element book at 0x117fd70c8>,
 <Element book at 0x117fd74c8>,
 <Element book at 0x117fd7148>,
 <Element book at 0x117fd88c8>,
 <Element book at 0x117fd8648>,
 <Element book at 0x117fd8e48>,
 <Element book at 0x117fd8d08>,
 <Element book at 0x117fd71c8>,
 <Element book at 0x117fd8d48>,
 <Element book at 0x117fd8cc8>]

In [33]:
root.book.author #this reflects hierarchy of the tree.

'Gambardella, Matthew'

In [34]:
[child.tag for child in root.book.getchildren()] #tag attribute allows to get names of node

['author', 'title', 'genre', 'price', 'publish_date', 'description']

In [35]:
#while .text attribute you get value between corresponding tags
[child.text for child in root.book.getchildren()]

['Gambardella, Matthew',
 "XML Developer's Guide",
 'Computer',
 '44.95',
 '2000-10-01',
 'An in-depth look at creating applications \n      with XML.']

In [36]:
#the following function will allow us to analyze the contents of etree to fill elements
#by line
# def etree2df(root):
#     column_names =[]
#     for i in range(0,len(root.getchildren()[0].getchildren())):
#         column_names.append(root.getchildren()[0].getchildren()[i].tag)
#     xml:frame = pd.DataFrame(columns=column_names)
#     for j in range(0,len(root.getchildren())):
#         obj = root.getchildren()[j].getchildren()
#         texts =[]
#         for k in range(0,len(column_names)):
#             texts.append(obj[k].text)
#         row = dict(zip(column_names,texts))
#         row_s = pd.Series(row)
#         row_s.name = j
#         xml:frame = xml:frame.append(row_s)
#     return xml:frame

##############DOESN'T WORK!!!!!!!#################
# xml:frame = xml:frame.append(row_s)
#                    ^
# SyntaxError: invalid syntax

In [37]:
import xml.etree.ElementTree as ET

tree = ET.parse('books.xml')

In [38]:
root = tree.getroot()

In [39]:
print(ET.fromstring('<a><b>1</b>2</a>'))

<Element 'a' at 0x1188844f8>

In [40]:
print(root.tag)

catalog

In [41]:
# def show(elem):
#     print(elem.tag)
#     for child in elem.findall('*'):
#         show(child)

# show(root)

In [42]:
# def show(elem, indent = 0):
#     print(' ' * indent + elem.tag)
#     for child in elem.findall('*'):
#          show(elem, indent + 1)

# show(root)

In [43]:
root.find('book').get('id')

'bk101'

In [44]:
root.find('book').get('id')

'bk101'

In [45]:
root.find('book').keys()

['id']

In [46]:
root.find('book').attrib

{'id': 'bk101'}

In [47]:
ET.fromstring('<a>Hello<b>1</b>2</a>').text

'Hello'

In [48]:
root.find('book/author').text

'Gambardella, Matthew'

In [49]:
root.findtext('book/author')

'Gambardella, Matthew'

In [50]:
ET.fromstring('<a>Hello<b>1</b>2</a>').find('b').tail

'2'

In [51]:
for e in root.findall('book/author'):
    print(e.text)

Gambardella, Matthew
Ralls, Kim
Corets, Eva
Corets, Eva
Corets, Eva
Randall, Cynthia
Thurman, Paula
Knorr, Stefan
Kress, Peter
O'Brien, Tim
O'Brien, Tim
Galos, Mike

In [52]:
print(root.find('book[2]/author').text)
# prints "Ralls, Kim"

Ralls, Kim

In [53]:
from functools import reduce
reduce(lambda x, y: x + '|' + y.text, root.findall("book/author"), '')

# prints "|Gambardella, Matthew|Ralls, Kim|Corets, Eva|Corets,
#Eva|Corets, Eva|Randall, Cynthia|Thurman, Paula|Knorr, Stefan|Kress,
#Peter|O'Brien, Tim|O'Brien, Tim|Galos, Mike"

"|Gambardella, Matthew|Ralls, Kim|Corets, Eva|Corets, Eva|Corets, Eva|Randall, Cynthia|Thurman, Paula|Knorr, Stefan|Kress, Peter|O'Brien, Tim|O'Brien, Tim|Galos, Mike"

## Reading and Writing Data on Microsoft Excel Files

In [54]:
pd.read_excel('ch05_data.xlsx') #only shows first sheet

   white  red  green  black
a     12   23     17     18
b     22   16     19     18
c     14   23     22     21

In [55]:
pd.read_excel('ch05_data.xlsx','Sheet2') #can call it this way

     yellow  purple  blue  orange
NaN      11      16    44      22
NaN      20      22    23      44
NaN      30      31    37      32

In [56]:
pd.read_excel('ch05_data.xlsx',1) #can call it using an index

     yellow  purple  blue  orange
NaN      11      16    44      22
NaN      20      22    23      44
NaN      30      31    37      32

In [57]:
frame = pd.DataFrame(np.random.random((4,4)),
                    index = ['exp1','exp2','exp3','exp4'],
                    columns = ['Jan2015','Feb2015','Mar2015','Apr2015'])
frame

       Jan2015   Feb2015   Mar2015   Apr2015
exp1  0.576914  0.944667  0.286610  0.688503
exp2  0.154174  0.105964  0.205511  0.569911
exp3  0.519492  0.718428  0.011529  0.484428
exp4  0.297219  0.812539  0.117387  0.121626

In [58]:
frame.to_excel('data2.xlsx')

## JSON(JavaScript Object Notation) Data
- can check using JSONViewer available at http://jsonviewer.stack.hu/

In [59]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                              index = ['white','black','red','blue'],
                              columns = ['up','down','right','left'])

In [60]:
frame.to_json('frame.json')
#creates file in working dir

In [61]:
pd.read_json('frame.json')

       up  down  right  left
black   4     5      6     7
blue   12    13     14    15
red     8     9     10    11
white   0     1      2     3

In [62]:
#we saw a simple ex with tabulated data but data isn't always in tabular form :)
#thus, you will need to somehow convert the stucture dict file into tabular form
from io import StringIO, TextIOBase, TextIOWrapper
from pandas.io.json import json_normalize
import json
file = open('books.json','r')
text = file.read()
text = json.dumps(text)
text = json.loads(text)
#json_normalize(text,'books')

In [63]:
# text= json.loads(text)
# file = 'books1.json'
# with open(file) as train_file:
#     dict_train = json.load(train_file)

# # converting json dataset from dictionary to dataframe
# train = pd.DataFrame.from_dict(dict_train, orient='index')
# train.reset_index(level=0, inplace=True)

In [64]:
# import json
# config = json.loads(open('books1.json').read())
# config
# JSONDecodeError: Expecting ',' delimiter: line 66 column 145 (char 3842)

In [65]:
#json_normalize(file,'books',['nationality','writer'])

In [66]:
#That shit didn't work but I will come back to it again....

## The Format HDF5
- stands for hierarchical data format --> this library is concerned with reading and writing HDF5 files containing a structure with nodes and the possibility to store multiple datasets
- fully developed in C, it also has interfaces in Python,MATLAB, and Java
    - effucient when using large amounts of data, compared to other formats that work in binary this format supports compression in real time thereby taking advantage of repetitive patterns in the data structure to compress the file size
    - we have PyTables and h5py

In [67]:
from pandas.io.pytables import HDFStore
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                    index = ['white','black','red','blue'],
                    columns = ['up','down','left','right'])
store = HDFStore('mydata1.h5')

In [68]:
store['obj1'] = frame #from here you can guess how you can store multiple data structures
                      #within the same HDF5 file, specifying for each a label
frame

       up  down  left  right
white   0     1     2      3
black   4     5     6      7
red     8     9    10     11
blue   12    13    14     15

In [69]:
store['obj2'] = frame
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata1.h5

In [70]:
store['obj2'] #can call data in the following

       up  down  left  right
white   0     1     2      3
black   4     5     6      7
red     8     9    10     11
blue   12    13    14     15

## Pickle- Python Object Serialization
- pickling is the process in which the hierarchy of an object is converted into a stream of bytes --> this allows the object to be transmitted and stored, and then to be rebuilt by the reciever itself retaining all the original features
- cPickle was written in C for optimization --> up to x1000 faster

## Serialize a Python Object with cPickle
- more specific to python, uses ASCII representation

In [71]:
import pickle
data = {'color':['white','red'],'value':[5,7]}
pickled_data = pickle.dumps(data)
print(pickled_data) #gives wonky ass serialization, I guess...

b'\x80\x03}q\x00(X\x05\x00\x00\x00colorq\x01]q\x02(X\x05\x00\x00\x00whiteq\x03X\x03\x00\x00\x00redq\x04eX\x05\x00\x00\x00valueq\x05]q\x06(K\x05K\x07eu.'

In [72]:
nframe = pickle.loads(pickled_data)
nframe

{'color': ['white', 'red'], 'value': [5, 7]}

In [73]:
# json.loads(text.decode("utf-8"))

## Pickling with Pandas
- pandas comes with this shit installed yo, can do that shit implicitly n shit

In [74]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
                    index =['up','down','left','right'])

In [75]:
frame.to_pickle('frame.pkl') #writes pickle to directory

In [76]:
pd.read_pickle('frame.pkl')

        0   1   2   3
up      0   1   2   3
down    4   5   6   7
left    8   9  10  11
right  12  13  14  15

# NOTE: When using this format, make sure that the file you open is SAFE. The pickle format was not designed to be protected against erroneous and maliciously constructed data

# Interacting with Databases
- usually data is stored in an SQL-based relational database, and also in many NoSQL dbs
- pandas.io.sql module provides a unifed interface independent of the db called sqlalchemy (lol)--> simplifies the connection mode, which the commands will be the same.
    - to make a connection make sure to use create_engine() function, you can configure all properties necessary to use the driver, user, password, port, and db instance
- can check other docs here at https://docs.sqlalchemy.org/en/latest/core/engines.html

In [77]:
from sqlalchemy import create_engine

In [78]:
#for PostgreSQL
engine = create_engine('postgresql://scott:tiger@localhost:5432/mydatabase')
# default
engine = create_engine('postgresql://scott:tiger@localhost/mydatabase')

# psycopg2
engine = create_engine('postgresql+psycopg2://scott:tiger@localhost/mydatabase')

# pg8000
#engine = create_engine('postgresql+pg8000://scott:tiger@localhost/mydatabase')

In [79]:
#for MySQL (DOESN'T FUCKING WORK)
#engine = create_engine('mysql+mysqldb://scott:tiger@localhost/foo')

# default
#engine = create_engine('mysql://scott:tiger@localhost/foo')

# mysql-python
#engine = create_engine('mysql+mysqldb://scott:tiger@localhost/foo')

# MySQL-connector-python
#engine = create_engine('mysql+mysqlconnector://scott:tiger@localhost/foo')

# OurSQL
#engine = create_engine('mysql+oursql://scott:tiger@localhost/foo')

#The PyODBC for MySQL dialect is not well supported, and is subject to
#unresolved character encoding issues which exist within the current 
#ODBC drivers available. (see http://code.google.com/p/pyodbc/issues/detail?id=25).
#Other dialects for MySQL are recommended.


# engine = create_engine(
#                 "mysql://scott:tiger@localhost/test",
#                 isolation_level="READ UNCOMMITTED"
#             )
#REFUSES TO FUCKING WORK

In [80]:
# pyodbc
engine = create_engine('mssql+pyodbc://scott:tiger@mydsn')

# pymssql
#engine = create_engine('mssql+pymssql://scott:tiger@hostname:port/dbname')

In [81]:
#Oracle
engine = create_engine('oracle://scott:tiger@127.0.0.1:1521/sidname')
engine = create_engine('oracle+cx_oracle://scott:tiger@tnsname')

In [82]:
import sqlalchemy.dialects.sqlite
# sqlite://<nohostname>/<path>
# where <path> is relative:
engine = create_engine('sqlite:///foo.db')

## Loading and Writing Data with SQLite3
- implements a DBMS SQL in a very simple and lightweight fashion
- good for those who want to practice before going to real dbs, or anyone who needs to use functions of a database to collect data, but remaining within a single program,w/o having to interface with a db

In [83]:
frame = pd.DataFrame(np.arange(20).reshape(4,5),
                    columns=['white','black','red','blue','green'])

In [84]:
engine = create_engine('sqlite:///foo.db') #implements connection

In [86]:
#frame.to_sql('colors',engine) #converts df to table in db

In [87]:
pd.read_sql('colors',engine)

   index  white  black  red  blue  green
0      0      0      1    2     3      4
1      1      5      6    7     8      9
2      2     10     11   12    13     14
3      3     15     16   17    18     19

In [88]:
#now lets est a connection to the db and create a tably by defining the corrected data
#types
import sqlite3

In [89]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
 );"""

In [90]:
con = sqlite3.connect(':memory:')

In [91]:
con.execute(query)

In [92]:
con.commit()

In [93]:
# now we can enter data using SQL INSERT statement
data = [('white','up',1,3),
       ('black','down',2,8),
       ('green','up',4,4),
       ('red','down',5,5)]

In [94]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [95]:
con.executemany(stmt,data)

In [96]:
con.commit()

In [97]:
#we've just written now it's time to query that bitch
cursor = con.execute('select * from test')
cursor

In [98]:
rows = cursor.fetchall()
rows

[('white', 'up', 1.0, 3),
 ('black', 'down', 2.0, 8),
 ('green', 'up', 4.0, 4),
 ('red', 'down', 5.0, 5)]

In [99]:
#you can pass lists of tuples to the constructor of the df
cursor.description #gives attributes of cursor

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [100]:
#original book codes didn't work since:
#In Python 2, zip returned a list. In Python 3, zip returns an iterable object.
#But you can make it into a list just by calling list.

pd.DataFrame(rows, columns=list(zip(*cursor.description))[0])

       a     b    c  d
0  white    up  1.0  3
1  black  down  2.0  8
2  green    up  4.0  4
3    red  down  5.0  5

## Loading and Writing Data with PostgreSQL

In [101]:
pd.__version__

'0.23.4'

In [110]:

engine = create_engine('postgresql://postgres:password@localhost:5432/postgres')
#connection = psycopg2.connect(database="postgres", user="postgres", password="password", host="localhost", port=5433)

In [103]:
frame = pd.DataFrame(np.random.random((4,4)),
                    index = ['exp1','exp2','exp3','exp4'],
                    columns = ['feb','mar','apr','may'])

In [114]:
try:
    frame.to_sql('dataframe',engine)
except:
    print('can\'t fucking do it man')

can't fucking do it man

In [113]:
try:
    pd.read_sql_table('dataframe',engine)
except:
    print('fuck this shite')

fuck this shite

In [112]:
import psycopg2

try:
    conn = psycopg2.connect("dbname='template1' user='dbuser' host='localhost' password='dbpass'")
except:
    print("I am unable to connect to the database")

I am unable to connect to the database

In [115]:
try:
    pd.read_sql_query('SELECT index,apr,may FROM DATAFRAME WHERE apr>0.5', engine)
except:
    print('Why don\'t I just work???')

Why don't I just work???

## Reaading and Writing Data with a NoSQL Database: MongoDB
 - please brew install this shit

In [119]:
#python -m pip install pymongo
import pymongo
from pymongo import MongoClient
client = MongoClient('localhost',27017)

In [120]:
db = client.mydatabase
db

Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'mydatabase')

In [121]:
#can also use
client['mydatabase']

Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'mydatabase')

In [122]:
collection = db.mycollection

In [123]:
db['mycollection']

Collection(Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'mydatabase'), 'mycollection')

In [124]:
collection

Collection(Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'mydatabase'), 'mycollection')

In [127]:
#time to load this hoe up
frame = pd.DataFrame(np.arange(20).reshape((4,5)),
                    columns = ['white','red','black','blue','green'])
frame

   white  red  black  blue  green
0      0    1      2     3      4
1      5    6      7     8      9
2     10   11     12    13     14
3     15   16     17    18     19

In [128]:
#before being added must be converted to a fuckin JSON which sucks dick
import json
record = json.loads(frame.T.to_json()).values()
record

dict_values([{'white': 0, 'red': 1, 'black': 2, 'blue': 3, 'green': 4}, {'white': 5, 'red': 6, 'black': 7, 'blue': 8, 'green': 9}, {'white': 10, 'red': 11, 'black': 12, 'blue': 13, 'green': 14}, {'white': 15, 'red': 16, 'black': 17, 'blue': 18, 'green': 19}])

In [134]:
#now we can use insert() command
#remember to turn on mongo on mac with :
#brew services start mongodb
collection.mydocument.insert_many(record)

In [151]:
#cursor = collection['mydocument'].find()
cursor = collection['mydocument'].find({}, {'_id': False}) #this is much easier

In [152]:
dataframe = (list(cursor))

In [153]:
dataframe

[{'white': 0, 'red': 1, 'black': 2, 'blue': 3, 'green': 4},
 {'white': 5, 'red': 6, 'black': 7, 'blue': 8, 'green': 9},
 {'white': 10, 'red': 11, 'black': 12, 'blue': 13, 'green': 14},
 {'white': 15, 'red': 16, 'black': 17, 'blue': 18, 'green': 19}]

# FINALLY FINISHED!!!!!!!!!!